q = int(input("Вы находитесь в землях, заселенных драконами. Перед собой вывидите две пещеры.В одной из них — дружелюбный дракон, который готов поделиться свами своими сокровищами.Во второй — жадный и голодный дракон, который мигом вас съест.В какую пещеру вы войдете? (нажмите клавишу 1 или 2)"))
print("Вы приближаетесь к пещере...Ее темнота заставляет вас дрожать от страха...Большой дракон выпрыгивает перед вами! Он раскрывает свою пасть и... ")

if q == 1:
    print("...делится с вами своими сокровищами!")
elif q == 2:
    print(" ...моментально вас съедает!")
print("Конец")